Revit 2027 API
BrowserOrganization.GetCurrentBrowserOrganizationForSheets Method
 Gets the BrowserOrganization that applies to the Sheets section of the project browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BrowserOrganization GetCurrentBrowserOrganizationForSheets(
	Document document
)
Public Shared Function GetCurrentBrowserOrganizationForSheets (
	document As Document
) As BrowserOrganization
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForSheets(
	Document^ document
)
static member GetCurrentBrowserOrganizationForSheets :
        document : Document -> BrowserOrganization
Parameters
document Document
 Revit document from which to get the organization data.
Return Value
BrowserOrganization
 The BrowserOrganization for sheets, or null if no sheets exist.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace